straga/micropython-esp32-twai/src/modcan.c
/* The MIT License (MIT)
 *
 * Copyright (c) 2019 Musumeci Salvatore
 * Copyright (c) 2021 Ihor Nehrutsa
 * Copyright (c) 2022 Yuriy Makarov
 * Copyright (c) 2023 Viktor Vorobjov
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to deal
 * in the Software without restriction, including without limitation the rights
 * to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
 * copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in
 * all copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
 * OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN
 * THE SOFTWARE.
 */

#include "esp32_compat.h"

#include "esp_random.h"
#include "esp_system.h"
#include "esp_idf_version.h"
#include "esp_task.h"

#include "driver/twai.h"
#include "hal/twai_types.h"
#include "hal/twai_hal.h"
#include "soc/twai_periph.h"
#include "soc/clk_tree_defs.h"
#include "soc/soc_caps.h"

// micropython includes
#include "mphalport.h"
#include "py/obj.h"
#include "py/runtime.h"
#include "py/objarray.h"
#include "py/binary.h"
#include "py/objint.h"
#include "py/objstr.h"
#include "py/objtype.h"
#include "py/objexcept.h"
#include "py/mphal.h" 
#include "py/mperrno.h"
#include "py/mpprint.h"
#include "modcan.h"


// #define _TO_STR(x) #x
// #define TO_STR(x) _TO_STR(x)

// // Define the macros to check the configuration
// #ifdef configSUPPORT_DYNAMIC_ALLOCATION
//     #pragma message ("configSUPPORT_DYNAMIC_ALLOCATION - Define: " TO_STR(configSUPPORT_DYNAMIC_ALLOCATION))
// #else
//     #pragma message ("configSUPPORT_DYNAMIC_ALLOCATION - Not Define")
// #endif

// #ifdef CONFIG_FREERTOS_UNICORE
//     #pragma message ("CONFIG_FREERTOS_UNICORE - Define: " TO_STR(CONFIG_FREERTOS_UNICORE))
// #else
//     #pragma message ("CONFIG_FREERTOS_UNICORE - Not Define")
// #endif

// #ifdef portNUM_PROCESSORS
//     #pragma message ("portNUM_PROCESSORS - Define: " TO_STR(portNUM_PROCESSORS))
// #else
//     #pragma message ("portNUM_PROCESSORS - Not Define")
// #endif

// Need for micropython second step compilation
extern BaseType_t xTaskCreatePinnedToCore(TaskFunction_t pxTaskCode,
    const char * const pcName,
    const uint32_t usStackDepth,
    void * const pvParameters,
    UBaseType_t uxPriority,
    TaskHandle_t * const pxCreatedTask,
    const BaseType_t xCoreID);


#ifndef __ASSEMBLER__
#include "soc/dport_access.h"
#endif



#define CAN_MODE_SILENT_LOOPBACK (0x10)

// Default baudrate: 500kb

#define CAN_TASK_PRIORITY           (ESP_TASK_PRIO_MIN + 1)  // Приоритет задачи CAN
#define CAN_TASK_STACK_SIZE         (1024)
//{.clk_src = TWAI_CLK_SRC_DEFAULT, 
//.quanta_resolution_hz = 10000000, 
//.brp = 0, .tseg_1 = 15, .tseg_2 = 4, .sjw = 3, .triple_sampling 

#define CAN_DEFAULT_PRESCALER       (8)
#define CAN_DEFAULT_SJW             (3)
#define CAN_DEFAULT_BS1             (15)
#define CAN_DEFAULT_BS2             (4)

#define CAN_MAX_DATA_FRAME          (8)


// Default bitrate from esp-idf for each baudrate and xtal frequency and chip: set aiutomatically
// #if CONFIG_XTAL_FREQ == 32   // TWAI_CLK_SRC_XTAL = 32M
// #define TWAI_TIMING_CONFIG_25KBITS()    {.clk_src = TWAI_CLK_SRC_DEFAULT, .quanta_resolution_hz = 400000, .brp = 0, .tseg_1 = 11, .tseg_2 = 4, .sjw = 3, .triple_sampling = false}
// #define TWAI_TIMING_CONFIG_50KBITS()    {.clk_src = TWAI_CLK_SRC_DEFAULT, .quanta_resolution_hz = 1000000, .brp = 0, .tseg_1 = 15, .tseg_2 = 4, .sjw = 3, .triple_sampling = false}
// #define TWAI_TIMING_CONFIG_100KBITS()   {.clk_src = TWAI_CLK_SRC_DEFAULT, .quanta_resolution_hz = 2000000, .brp = 0, .tseg_1 = 15, .tseg_2 = 4, .sjw = 3, .triple_sampling = false}
// #define TWAI_TIMING_CONFIG_125KBITS()   {.clk_src = TWAI_CLK_SRC_DEFAULT, .quanta_resolution_hz = 4000000, .brp = 0, .tseg_1 = 23, .tseg_2 = 8, .sjw = 3, .triple_sampling = false}
// #define TWAI_TIMING_CONFIG_250KBITS()   {.clk_src = TWAI_CLK_SRC_DEFAULT, .quanta_resolution_hz = 4000000, .brp = 0, .tseg_1 = 11, .tseg_2 = 4, .sjw = 3, .triple_sampling = false}
// #define TWAI_TIMING_CONFIG_500KBITS()   {.clk_src = TWAI_CLK_SRC_DEFAULT, .quanta_resolution_hz = 8000000, .brp = 0, .tseg_1 = 11, .tseg_2 = 4, .sjw = 3, .triple_sampling = false}
// #define TWAI_TIMING_CONFIG_800KBITS()   {.clk_src = TWAI_CLK_SRC_DEFAULT, .quanta_resolution_hz = 16000000, .brp = 0, .tseg_1 = 15, .tseg_2 = 4, .sjw = 3, .triple_sampling = false}
// #define TWAI_TIMING_CONFIG_1MBITS()     {.clk_src = TWAI_CLK_SRC_DEFAULT, .quanta_resolution_hz = 16000000, .brp = 0, .tseg_1 = 11, .tseg_2 = 4, .sjw = 3, .triple_sampling = false}

// #elif CONFIG_XTAL_FREQ == 40   // TWAI_CLK_SRC_XTAL = 40M
// #define TWAI_TIMING_CONFIG_25KBITS()    {.clk_src = TWAI_CLK_SRC_DEFAULT, .quanta_resolution_hz = 625000, .brp = 0, .tseg_1 = 16, .tseg_2 = 8, .sjw = 3, .triple_sampling = false}
// #define TWAI_TIMING_CONFIG_50KBITS()    {.clk_src = TWAI_CLK_SRC_DEFAULT, .quanta_resolution_hz = 1000000, .brp = 0, .tseg_1 = 15, .tseg_2 = 4, .sjw = 3, .triple_sampling = false}
// #define TWAI_TIMING_CONFIG_100KBITS()   {.clk_src = TWAI_CLK_SRC_DEFAULT, .quanta_resolution_hz = 2000000, .brp = 0, .tseg_1 = 15, .tseg_2 = 4, .sjw = 3, .triple_sampling = false}
// #define TWAI_TIMING_CONFIG_125KBITS()   {.clk_src = TWAI_CLK_SRC_DEFAULT, .quanta_resolution_hz = 2500000, .brp = 0, .tseg_1 = 15, .tseg_2 = 4, .sjw = 3, .triple_sampling = false}
// #define TWAI_TIMING_CONFIG_250KBITS()   {.clk_src = TWAI_CLK_SRC_DEFAULT, .quanta_resolution_hz = 5000000, .brp = 0, .tseg_1 = 15, .tseg_2 = 4, .sjw = 3, .triple_sampling = false}
// #define TWAI_TIMING_CONFIG_500KBITS()   {.clk_src = TWAI_CLK_SRC_DEFAULT, .quanta_resolution_hz = 10000000, .brp = 0, .tseg_1 = 15, .tseg_2 = 4, .sjw = 3, .triple_sampling = false}
// #define TWAI_TIMING_CONFIG_800KBITS()   {.clk_src = TWAI_CLK_SRC_DEFAULT, .quanta_resolution_hz = 20000000, .brp = 0, .tseg_1 = 16, .tseg_2 = 8, .sjw = 3, .triple_sampling = false}
// #define TWAI_TIMING_CONFIG_1MBITS()     {.clk_src = TWAI_CLK_SRC_DEFAULT, .quanta_resolution_hz = 20000000, .brp = 0, .tseg_1 = 15, .tseg_2 = 4, .sjw = 3, .triple_sampling = false}
// #endif  //CONFIG_XTAL_FREQ

