straga/micropython-esp32-twai/src/modcan.c
/*
// Internal Functions
mp_obj_t esp32_hw_can_make_new(const mp_obj_type_t *type, size_t n_args, size_t n_kw, const mp_obj_t *args);
static mp_obj_t esp32_hw_can_init_helper(esp32_can_obj_t *self, size_t n_args, const mp_obj_t *pos_args, mp_map_t *kw_args);
static void esp32_hw_can_print(const mp_print_t *print, mp_obj_t self_in, mp_print_kind_t kind);
*/
// INTERNAL Deinitialize can
void can_deinit(const esp32_can_obj_t *self) {
    check_esp_err(twai_stop());
    check_esp_err(twai_driver_uninstall());
    if (self->irq_handler != NULL) {
        vTaskDelete(self->irq_handler);
    }
    self->config->initialized = false;
}

static const twai_filter_config_t f_config = TWAI_FILTER_CONFIG_ACCEPT_ALL();
static const twai_timing_config_t t_config = TWAI_TIMING_CONFIG_25KBITS();
//{.clk_src = TWAI_CLK_SRC_DEFAULT, .quanta_resolution_hz = 400000, .brp = 0, .tseg_1 = 11, .tseg_2 = 4, .sjw = 3, .triple_sampling = false}
//static const twai_timing_config_t t_config = {.clk_src = TWAI_CLK_SRC_DEFAULT, .quanta_resolution_hz = 400000, .brp = 0, .tseg_1 = 11, .tseg_2 = 4, .sjw = 3, .triple_sampling = false};
// static const twai_timing_config_t t_config = {
//     twai_timing_config_t config = TWAI_TIMING_CONFIG_25KBITS();
//     config.clk_src = TWAI_CLK_SRC_DEFAULT;
//     return config;
// }();

// singleton CAN device object
esp32_can_config_t can_config = {
    .general = TWAI_GENERAL_CONFIG_DEFAULT(GPIO_NUM_2, GPIO_NUM_4, TWAI_MODE_NORMAL),
    .filter = f_config,  // TWAI_FILTER_CONFIG_ACCEPT_ALL(),
    .timing = t_config,  // TWAI_TIMING_CONFIG_25KBITS()
    .initialized = false
};

static esp32_can_obj_t esp32_can_obj = {
    {&machine_can_type},
    .config = &can_config
};

// INTERNAL FUNCTION Return status information
static twai_status_info_t _esp32_hw_can_get_status() {
    twai_status_info_t status;
    check_esp_err(twai_get_status_info(&status));
    return status;
}

static void esp32_hw_can_print(const mp_print_t *print, mp_obj_t self_in, mp_print_kind_t kind) {
    esp32_can_obj_t *self = MP_OBJ_TO_PTR(self_in);

    if (self->config->initialized) {
        qstr mode;
        switch (self->config->general.mode) {
        case TWAI_MODE_LISTEN_ONLY:
            mode = MP_QSTR_LISTEN;
            break;
        case TWAI_MODE_NO_ACK:
            mode = MP_QSTR_NO_ACK;
            break;
        case TWAI_MODE_NORMAL:
            mode = MP_QSTR_NORMAL;
            break;
        default:
            mode = MP_QSTR_UNKNOWN;
            break;
        }
        mp_printf(print, "CAN(tx=%u, rx=%u, baudrate=%lukb, mode=%q, loopback=%u, extframe=%u)",
                  self->config->general.tx_io,
                  self->config->general.rx_io,
                  self->config->baudrate,
                  mode,
                  self->loopback,
                  self->extframe);
    } else {
        mp_printf(print, "Device is not initialized");
    }
}

// INTERNAL FUNCTION FreeRTOS IRQ task
static void esp32_hw_can_irq_task(void *self_in) {
    esp32_can_obj_t *self = (esp32_can_obj_t *)self_in;
    uint32_t alerts;

    
    check_esp_err(twai_reconfigure_alerts(TWAI_ALERT_ALL,
        // TWAI_ALERT_RX_DATA | TWAI_ALERT_RX_QUEUE_FULL | TWAI_ALERT_BUS_OFF | TWAI_ALERT_ERR_PASS |
        // TWAI_ALERT_ABOVE_ERR_WARN | TWAI_ALERT_TX_FAILED | TWAI_ALERT_TX_SUCCESS | TWAI_ALERT_BUS_RECOVERED,
        // TWAI_ALERT_TX_IDLE | TWAI_ALERT_BELOW_ERR_WARN | TWAI_ALERT_ERR_ACTIVE | TWAI_ALERT_RECOVERY_IN_PROGRESS |
        // TWAI_ALERT_ARB_LOST | TWAI_ALERT_BUS_ERROR | TWAI_ALERT_RX_FIFO_OVERRUN | TWAI_ALERT_TX_RETRIED | TWAI_ALERT_PERIPH_RESET,
        NULL
        ));

    mp_printf(&mp_plat_print, "CAN IRQ Alert: task started\n");

    while (1) {
        check_esp_err(twai_read_alerts(&alerts, portMAX_DELAY));

        if (alerts & TWAI_ALERT_BUS_OFF) {
            ++self->num_bus_off;
        }
        if (alerts & TWAI_ALERT_ERR_PASS) {
            ++self->num_error_passive;
        }
        if (alerts & TWAI_ALERT_ABOVE_ERR_WARN) {
            ++self->num_error_warning;
        }

        if (alerts & (TWAI_ALERT_TX_FAILED | TWAI_ALERT_TX_SUCCESS)) {
            self->last_tx_success = (alerts & TWAI_ALERT_TX_SUCCESS) > 0;
        }

        if (alerts & (TWAI_ALERT_BUS_RECOVERED)) {
            self->bus_recovery_success = true;
        }

        if (self->rxcallback != mp_const_none) {
            if (alerts & TWAI_ALERT_RX_DATA) {
                uint32_t msgs_to_rx = _esp32_hw_can_get_status().msgs_to_rx;

                if (msgs_to_rx == 1) {
                    // first message in queue
                    mp_sched_schedule(self->rxcallback, MP_OBJ_NEW_SMALL_INT(0));
                } else if (msgs_to_rx >= self->config->general.rx_queue_len) {
                    // queue is full
                    mp_sched_schedule(self->rxcallback, MP_OBJ_NEW_SMALL_INT(1));
                }
            }
            if (alerts & TWAI_ALERT_RX_QUEUE_FULL) {
                // queue overflow
                mp_sched_schedule(self->rxcallback, MP_OBJ_NEW_SMALL_INT(2));
            }
        }
    }
}

#define TWAI_CHECK(cond, ret_val) ({                                        \
            if (!(cond)) {                                                  \
                return (ret_val);                                           \
            }                                                               \
})

// init(mode, tx=5, rx=4, baudrate=500000, prescaler=8, sjw=3, bs1=15, bs2=4, auto_restart=False, tx_queue=1, rx_queue=1)
static mp_obj_t esp32_hw_can_init_helper(esp32_can_obj_t *self, size_t n_args, const mp_obj_t *pos_args, mp_map_t *kw_args) {
    enum { ARG_mode, ARG_extframe, ARG_prescaler, ARG_sjw, ARG_bs1, ARG_bs2, ARG_auto_restart, ARG_baudrate, 
           ARG_tx_io, ARG_rx_io, ARG_tx_queue, ARG_rx_queue};

    static const mp_arg_t allowed_args[] = {
        { MP_QSTR_mode,         MP_ARG_REQUIRED | MP_ARG_INT,   {.u_int = TWAI_MODE_NORMAL} },
        { MP_QSTR_extframe,     MP_ARG_BOOL,                    {.u_bool = false} },
        { MP_QSTR_prescaler,    MP_ARG_KW_ONLY | MP_ARG_INT,    {.u_int = CAN_DEFAULT_PRESCALER} },
        { MP_QSTR_sjw,          MP_ARG_KW_ONLY | MP_ARG_INT,    {.u_int = CAN_DEFAULT_SJW} },
        { MP_QSTR_bs1,          MP_ARG_KW_ONLY | MP_ARG_INT,    {.u_int = CAN_DEFAULT_BS1} },
        { MP_QSTR_bs2,          MP_ARG_KW_ONLY | MP_ARG_INT,    {.u_int = CAN_DEFAULT_BS2} },
        { MP_QSTR_auto_restart, MP_ARG_BOOL,                    {.u_bool = false} },
        { MP_QSTR_baudrate,     MP_ARG_KW_ONLY | MP_ARG_INT,    {.u_int = 500000} },
        { MP_QSTR_tx,           MP_ARG_INT,                     {.u_int = 4} },
        { MP_QSTR_rx,           MP_ARG_INT,                     {.u_int = 5} },
        { MP_QSTR_tx_queue,     MP_ARG_INT,                     {.u_int = 1} },
        { MP_QSTR_rx_queue,     MP_ARG_INT,                     {.u_int = 1} },
    };

    // parse args
    mp_arg_val_t args[MP_ARRAY_SIZE(allowed_args)];
    mp_arg_parse_all(n_args, pos_args, kw_args, MP_ARRAY_SIZE(allowed_args), allowed_args, args);

