straga/micropython-esp32-twai/src/modcan.c
    // Configure device
    self->loopback = ((args[ARG_mode].u_int & CAN_MODE_SILENT_LOOPBACK) > 0);
    
    // If loopback mode is set, use TWAI_MODE_NO_ACK as in the official example
    if (self->loopback) {
        self->config->general.mode = TWAI_MODE_NO_ACK; 
    } else {
        self->config->general.mode = args[ARG_mode].u_int & 0x0F;
    }
    
    self->config->general.tx_io = args[ARG_tx_io].u_int;
    self->config->general.rx_io = args[ARG_rx_io].u_int;
    self->config->general.clkout_io = TWAI_IO_UNUSED;
    self->config->general.bus_off_io = TWAI_IO_UNUSED;
    self->config->general.tx_queue_len = args[ARG_tx_queue].u_int;
    self->config->general.rx_queue_len = args[ARG_rx_queue].u_int;
    self->config->general.alerts_enabled = TWAI_ALERT_ALL;
    
    self->config->general.clkout_divider = 0;

    self->extframe = args[ARG_extframe].u_bool;
    if (args[ARG_auto_restart].u_bool) {
        mp_raise_NotImplementedError(MP_ERROR_TEXT("Auto-restart not supported"));
    }
    self->config->filter = f_config; // TWAI_FILTER_CONFIG_ACCEPT_ALL();

    // clear errors
    self->num_error_warning = 0;
    self->num_error_passive = 0;
    self->num_bus_off = 0;

    // Calculate CAN nominal bit timing from baudrate if provided

    // .clk_src = TWAI_CLK_SRC_DEFAULT, 
    // .quanta_resolution_hz = 20000, 
    // .brp = 0, 
    // .tseg_1 = 15, 
    // .tseg_2 = 4, 
    // .sjw = 3, 
    // .triple_sampling = false
    // {.brp = 4000, .tseg_1 = 15, .tseg_2 = 4, .sjw = 3, .triple_sampling = false}


    switch ((int)args[ARG_baudrate].u_int) {
        case 0:
            self->config->timing = (twai_timing_config_t) {
                .brp = args[ARG_prescaler].u_int,
                .sjw = args[ARG_sjw].u_int,
                .tseg_1 = args[ARG_bs1].u_int,
                .tseg_2 = args[ARG_bs2].u_int,
                .triple_sampling = false
            };
            break;
        #ifdef TWAI_TIMING_CONFIG_1KBITS
        case 1000:
            self->config->timing = (twai_timing_config_t)TWAI_TIMING_CONFIG_1KBITS();
            break;
        #endif
        #ifdef TWAI_TIMING_CONFIG_5KBITS
        case 5000:
            self->config->timing = (twai_timing_config_t)TWAI_TIMING_CONFIG_5KBITS();
            break;
        #endif
        #ifdef TWAI_TIMING_CONFIG_10KBITS
        case 10000:
            self->config->timing = (twai_timing_config_t)TWAI_TIMING_CONFIG_10KBITS();
            break;
        #endif
        #ifdef TWAI_TIMING_CONFIG_12_5KBITS
        case 12500:
            self->config->timing = (twai_timing_config_t)TWAI_TIMING_CONFIG_12_5KBITS();
            break;
        #endif
        #ifdef TWAI_TIMING_CONFIG_16KBITS
        case 16000:
            self->config->timing = (twai_timing_config_t)TWAI_TIMING_CONFIG_16KBITS();
            break;
        #endif
        #ifdef TWAI_TIMING_CONFIG_20KBITS
        case 20000:
            self->config->timing = (twai_timing_config_t)TWAI_TIMING_CONFIG_20KBITS();
            break;
        #endif
        #ifdef TWAI_TIMING_CONFIG_25KBITS
        case 25000:
            self->config->timing = (twai_timing_config_t)TWAI_TIMING_CONFIG_25KBITS();
            break;
        #endif
        #ifdef TWAI_TIMING_CONFIG_50KBITS
        case 50000:
            self->config->timing = (twai_timing_config_t)TWAI_TIMING_CONFIG_50KBITS();
            break;
        #endif
        #ifdef TWAI_TIMING_CONFIG_100KBITS
        case 100000:
            self->config->timing = (twai_timing_config_t)TWAI_TIMING_CONFIG_100KBITS();
            break;
        #endif
        #ifdef TWAI_TIMING_CONFIG_125KBITS
        case 125000:
            self->config->timing = (twai_timing_config_t)TWAI_TIMING_CONFIG_125KBITS();
            break;
        #endif
        #ifdef TWAI_TIMING_CONFIG_250KBITS
        case 250000:
            self->config->timing = (twai_timing_config_t)TWAI_TIMING_CONFIG_250KBITS();
            break;
        #endif
        #ifdef TWAI_TIMING_CONFIG_500KBITS
        case 500000:
            self->config->timing = (twai_timing_config_t)TWAI_TIMING_CONFIG_500KBITS();
            break;
        #endif
        #ifdef TWAI_TIMING_CONFIG_800KBITS
        case 800000:
            self->config->timing = (twai_timing_config_t)TWAI_TIMING_CONFIG_800KBITS();
            break;
        #endif
        #ifdef TWAI_TIMING_CONFIG_1MBITS
        case 1000000:
            self->config->timing = (twai_timing_config_t)TWAI_TIMING_CONFIG_1MBITS();
            break;
        #endif
        default:
            self->config->baudrate = 0;
            mp_raise_ValueError("Unable to set bitrate");
            return mp_const_none;
    }

    self->config->baudrate = (int)args[ARG_baudrate].u_int;

    mp_printf(&mp_plat_print, "CAN: TIMING\n");
    mp_printf(&mp_plat_print, "CAN: timing brp=%lu\n", self->config->timing.brp);
    mp_printf(&mp_plat_print, "CAN: timing tseg_1=%u\n", self->config->timing.tseg_1);
    mp_printf(&mp_plat_print, "CAN: timing tseg_2=%u\n", self->config->timing.tseg_2);
    mp_printf(&mp_plat_print, "CAN: timing sjw=%u\n", self->config->timing.sjw);
    mp_printf(&mp_plat_print, "CAN: timing triple_sampling=%u\n", self->config->timing.triple_sampling);

    mp_printf(&mp_plat_print, "CAN: BRP_MIN=%u, BRP_MAX=%u\n", SOC_TWAI_BRP_MIN, SOC_TWAI_BRP_MAX);
    mp_printf(&mp_plat_print, "CAN: baudrate %lukb\n", self->config->baudrate);
    mp_printf(&mp_plat_print, "CAN: Mode %u\n", self->config->general.mode);
    
    mp_printf(&mp_plat_print, "CAN: Loopback flag %u\n", self->loopback);



    check_esp_err(twai_driver_install(&self->config->general, &self->config->timing, &self->config->filter));
    check_esp_err(twai_start());

    if (xTaskCreatePinnedToCore(esp32_hw_can_irq_task, "can_irq_task", CAN_TASK_STACK_SIZE, self, CAN_TASK_PRIORITY, (TaskHandle_t *)&self->irq_handler, 1) != pdPASS) {
        mp_raise_msg(&mp_type_RuntimeError, MP_ERROR_TEXT("failed to create can irq task handler"));
    }
    self->config->initialized = true;
    return mp_const_none;
}

