straga/micropython-esp32-twai/src/modcan.c
    list->items[0] = MP_OBJ_NEW_SMALL_INT(status.tx_error_counter);
    list->items[1] = MP_OBJ_NEW_SMALL_INT(status.rx_error_counter);
    list->items[2] = MP_OBJ_NEW_SMALL_INT(self->num_error_warning);
    list->items[3] = MP_OBJ_NEW_SMALL_INT(self->num_error_passive);
    list->items[4] = MP_OBJ_NEW_SMALL_INT(self->num_bus_off);
    list->items[5] = MP_OBJ_NEW_SMALL_INT(status.msgs_to_tx);
    list->items[6] = MP_OBJ_NEW_SMALL_INT(status.msgs_to_rx);
    list->items[7] = mp_const_none;

    return MP_OBJ_FROM_PTR(list);
}
static MP_DEFINE_CONST_FUN_OBJ_VAR_BETWEEN(esp32_hw_can_get_counters_obj, 1, 2, esp32_hw_can_get_counters);

// Get timings
static mp_obj_t esp32_hw_can_get_timings(size_t n_args, const mp_obj_t *args) {
    esp32_can_obj_t *self = MP_OBJ_TO_PTR(args[0]);
    if (!self->config->initialized) {
        mp_raise_ValueError(NULL);
    }
    
    mp_obj_list_t *list;
    if (n_args == 1) {
        list = MP_OBJ_TO_PTR(mp_obj_new_list(5, NULL));
    } else {
        if (!mp_obj_is_type(args[1], &mp_type_list)) {
            mp_raise_TypeError(NULL);
        }
        list = MP_OBJ_TO_PTR(args[1]);
        if (list->len < 5) {
            mp_raise_ValueError(NULL);
        }
    }
    
    // Заполняем список параметрами таймингов
    list->items[0] = MP_OBJ_NEW_SMALL_INT(self->config->timing.brp);
    list->items[1] = MP_OBJ_NEW_SMALL_INT(self->config->timing.tseg_1);
    list->items[2] = MP_OBJ_NEW_SMALL_INT(self->config->timing.tseg_2);
    list->items[3] = MP_OBJ_NEW_SMALL_INT(self->config->timing.sjw);
    list->items[4] = mp_obj_new_bool(self->config->timing.triple_sampling);
    
    return MP_OBJ_FROM_PTR(list);
}
static MP_DEFINE_CONST_FUN_OBJ_VAR_BETWEEN(esp32_hw_can_get_timings_obj, 1, 2, esp32_hw_can_get_timings);

// Reset CAN controller
static mp_obj_t esp32_hw_can_reset(size_t n_args, const mp_obj_t *pos_args, mp_map_t *kw_args) {
    enum { ARG_mode };
    static const mp_arg_t allowed_args[] = {
        { MP_QSTR_mode, MP_ARG_INT, {.u_int = TWAI_MODE_NORMAL} },
    };
    
    esp32_can_obj_t *self = MP_OBJ_TO_PTR(pos_args[0]);
    if (!self->config->initialized) {
        mp_raise_ValueError(NULL);
    }
    
    mp_arg_val_t args[MP_ARRAY_SIZE(allowed_args)];
    mp_arg_parse_all(n_args - 1, pos_args + 1, kw_args, MP_ARRAY_SIZE(allowed_args), allowed_args, args);
       
    // Stop the driver and uninstall it
    check_esp_err(twai_stop());
    check_esp_err(twai_driver_uninstall());
    
    // Update mode
    self->config->general.mode = args[ARG_mode].u_int;
    
    // Initialize the driver with the new mode
    check_esp_err(twai_driver_install(&self->config->general, &self->config->timing, &self->config->filter));
    check_esp_err(twai_start());
    
    return mp_const_none;
}
static MP_DEFINE_CONST_FUN_OBJ_KW(esp32_hw_can_reset_obj, 1, esp32_hw_can_reset);

// Get/Set CAN controller mode
static mp_obj_t esp32_hw_can_mode(size_t n_args, const mp_obj_t *pos_args, mp_map_t *kw_args) {
    enum { ARG_mode };
    static const mp_arg_t allowed_args[] = {
        { MP_QSTR_mode, MP_ARG_INT | MP_ARG_REQUIRED, {.u_int = TWAI_MODE_NORMAL} },
    };
    
    esp32_can_obj_t *self = MP_OBJ_TO_PTR(pos_args[0]);
    if (!self->config->initialized) {
        mp_raise_ValueError(NULL);
    }
    
    // If no arguments are provided, return the current mode
    if (n_args == 1 && kw_args->used == 0) {
        return mp_obj_new_int(self->config->general.mode);
    }
    
    // Extract the mode argument
    mp_arg_val_t args[MP_ARRAY_SIZE(allowed_args)];
    mp_arg_parse_all(n_args - 1, pos_args + 1, kw_args, MP_ARRAY_SIZE(allowed_args), allowed_args, args);
       
    // before changing the mode , stop and uninstall the driver
    check_esp_err(twai_stop());
    check_esp_err(twai_driver_uninstall());
    
    // Update the mode
    self->config->general.mode = args[ARG_mode].u_int;
    
    // initialize the driver with the new mode
    check_esp_err(twai_driver_install(&self->config->general, &self->config->timing, &self->config->filter));
    check_esp_err(twai_start());
    
    return mp_obj_new_int(self->config->general.mode);
}
static MP_DEFINE_CONST_FUN_OBJ_KW(esp32_hw_can_mode_obj, 1, esp32_hw_can_mode);

static const mp_rom_map_elem_t esp32_can_locals_dict_table[] = {
    // CAN_ATTRIBUTES
    { MP_ROM_QSTR(MP_QSTR___name__), MP_ROM_QSTR(MP_QSTR_CAN) },
    // Micropython Generic API
    { MP_ROM_QSTR(MP_QSTR_init), MP_ROM_PTR(&esp32_hw_can_init_obj) },
    { MP_ROM_QSTR(MP_QSTR_deinit), MP_ROM_PTR(&esp32_hw_can_deinit_obj) },
    { MP_ROM_QSTR(MP_QSTR_restart), MP_ROM_PTR(&esp32_hw_can_restart_obj) },
    { MP_ROM_QSTR(MP_QSTR_state), MP_ROM_PTR(&esp32_hw_can_state_obj) },
    { MP_ROM_QSTR(MP_QSTR_info), MP_ROM_PTR(&esp32_hw_can_info_obj) },
    { MP_ROM_QSTR(MP_QSTR_any), MP_ROM_PTR(&esp32_hw_can_any_obj) },
    { MP_ROM_QSTR(MP_QSTR_send), MP_ROM_PTR(&esp32_hw_can_send_obj) },
    { MP_ROM_QSTR(MP_QSTR_recv), MP_ROM_PTR(&esp32_hw_can_recv_obj) },
    { MP_ROM_QSTR(MP_QSTR_setfilter), MP_ROM_PTR(&esp32_hw_can_setfilter_obj) },
    { MP_ROM_QSTR(MP_QSTR_clearfilter), MP_ROM_PTR(&esp32_hw_can_clearfilter_obj) },
    { MP_ROM_QSTR(MP_QSTR_rxcallback), MP_ROM_PTR(&esp32_hw_can_rxcallback_obj) },
    // ESP32 Specific API
    { MP_OBJ_NEW_QSTR(MP_QSTR_clear_tx_queue), MP_ROM_PTR(&esp32_hw_can_clear_tx_queue_obj) },
    { MP_OBJ_NEW_QSTR(MP_QSTR_clear_rx_queue), MP_ROM_PTR(&esp32_hw_can_clear_rx_queue_obj) },
    { MP_OBJ_NEW_QSTR(MP_QSTR_get_alerts), MP_ROM_PTR(&esp32_hw_can_alert_obj) },
    { MP_OBJ_NEW_QSTR(MP_QSTR_get_state), MP_ROM_PTR(&esp32_hw_can_get_state_obj) },
    { MP_OBJ_NEW_QSTR(MP_QSTR_get_counters), MP_ROM_PTR(&esp32_hw_can_get_counters_obj) },
    { MP_OBJ_NEW_QSTR(MP_QSTR_get_timings), MP_ROM_PTR(&esp32_hw_can_get_timings_obj) },
    { MP_OBJ_NEW_QSTR(MP_QSTR_reset), MP_ROM_PTR(&esp32_hw_can_reset_obj) },
    { MP_OBJ_NEW_QSTR(MP_QSTR_mode), MP_ROM_PTR(&esp32_hw_can_mode_obj) },
    // CAN_MODE
    { MP_ROM_QSTR(MP_QSTR_NORMAL), MP_ROM_INT(TWAI_MODE_NORMAL) },                                     //ESP32 exist TWAI_MODE_NORMAL
    { MP_ROM_QSTR(MP_QSTR_LOOPBACK), MP_ROM_INT(TWAI_MODE_NORMAL | CAN_MODE_SILENT_LOOPBACK) },
    { MP_ROM_QSTR(MP_QSTR_SILENT), MP_ROM_INT(TWAI_MODE_NO_ACK) },                                     //ESP32 exist TWAI_MODE_NO_ACK
    { MP_ROM_QSTR(MP_QSTR_SILENT_LOOPBACK), MP_ROM_INT(TWAI_MODE_NO_ACK | CAN_MODE_SILENT_LOOPBACK) }, 
    { MP_ROM_QSTR(MP_QSTR_LISTEN_ONLY), MP_ROM_INT(TWAI_MODE_LISTEN_ONLY) },                           //ESP32 exist TWAI_MODE_LISTEN_ONLY


